/*
	0 - empty space
	1 - place for put box
	2 - box for moving
	3 - finishing move box
	4 - simple wall box
*/

var Levels = [
	{
		levelName: 'Level_0',
		levelDisplayName: 'Легкая добыча',
		map: [
			[0,2,0,0,0,1,0],
			[0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0],
			[0,0,0,0,0,0,0]
		]
	},
	{
		levelName: 'Level_1',
		levelDisplayName: 'Близнецы',
		map: [
			[0,2,0,0,0,2,0],
			[0,0,0,0,0,0,0],
			[0,0,0,0,0,1,0],
			[0,0,0,0,1,0,0],
			[0,0,0,0,0,0,0]
		]
	},
	{
		levelName: 'Level_2',
		levelDisplayName: 'Препятствия',
		map: [
			[0,0,1,0,0,0,0],
			[0,2,0,0,0,4,0],
			[0,0,0,0,0,0,0],
			[0,4,0,0,0,4,0],
			[0,0,0,0,4,4,0]
		]
	},
	{
		levelName: 'Level_3',
		levelDisplayName: 'Не все так просто...',
		map: [
			[0,0,1,0,0,1,0,0],
			[0,0,2,0,0,0,0,0],
			[0,0,0,0,0,0,4,0],
			[0,4,0,0,0,0,2,0],
			[0,0,0,0,0,0,0,0]
		]
	},
	{
		levelName: 'Level_4',
		levelDisplayName: 'Четверо смелых',
		map: [
			[0,2,1,1,1,1,0],
			[0,0,2,0,0,0,0],
			[0,0,0,0,0,0,4],
			[0,4,0,0,0,0,2],
			[0,0,0,0,0,0,0],
			[0,0,4,0,0,2,0]
		]
	}
];
